Revit 2027 API
ViewSheetSetting.SaveAs Method
Save the current view sheet set to another view sheet set with the specified name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SaveAs(
	string newName
)
Public Function SaveAs (
	newName As String
) As Boolean
public:
bool SaveAs(
	String^ newName
)
member SaveAs :
        newName : string -> bool
Parameters
newName String
View sheet set name to be saved as.
Return Value
Boolean
False if Save As operation fails, otherwise True.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the input name is already existed in current view sheet set list.
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace